{
  "above-the-fold": {
    "scroll": "Scroll",
    "down": "Down"
  },
  "header": {
    "about-me": "About me",
    "my-skills": "My skills",
    "portfolio": "Portfolio"
  },
  "about-me": {
    "headline": "About Me",
    "description": "I am an Frontend Developer with a strong interest in software development and modern technologies. I am passionate about coding because I enjoy turning ideas into practical solutions and continuously improving my skills. I am eager to learn new technologies and adapt to changing technical environments. My problem-solving approach is analytical and structured, while also allowing room for creativity. I value persistence when facing complex challenges and enjoy collaborating with others to achieve effective and maintainable solutions.",
    "based-in": "Based in Weissach",
    "work": "Open to work Remote",
    "let`s-talk": "Let`s talk!"
  },
  "my-skills": {
    "headline": "My Skills",
    "description-one": "Don’t see the skill you need?",
    "description-two": "I’m always ready to learn!",
    "contact-me": "Contact me."
  },
  "portfolio": {
    "description-one": "Explore a selection of my work here - Interact with",
    "description-two": "projects to see my skills in aktion!",
    "join": "Work in progress",
    "el-pollo-loco": "Fun and interactive web game where players have to defeat chickens. Features dynamic animations, responsive layout, and engaging gameplay.",
    "pokedex": "Interactive Pokédex app to explore Pokémon with dynamic search, detailed info, and a clean, responsive design."
  },
  "references": {
    "subheadline": "I thrive both independently and as part of a team. Here’s what my colleagues have to say about working with me.",
    "reference-one": "„A highly talented developer with a keen eye for detail. Their code is clean, well-structured, and easy to understand.“",
    "reference-two": "„Works very efficiently and learns new technologies quickly. Collaboration is enjoyable and reliable.“",
    "reference-three": "„A creative mind who delivers practical and engaging web projects. Always open to feedback and improvements.“"
  },
  "say-hi": {
    "headline": "Say Hi!",
    "subheadline-one": "Want to discuss a new project?",
    "subheadline-two": "Say hello! let`s discuss your ideas and make it happen",
    "your-name": "Your Name",
    "name-required": "Your name is required.",
    "your-email": "Your email",
    "email-required": "Please enter a valid email address.",
    "your-message": "Your Message",
    "message-required": "Your message is empty.",
    "privacy-policy-one": "I`ve read the",
    "privacy-policy-two": "privacy policy",
    "privacy-policy-three": "and agree to the processing of my data outlined.",
    "privacy-policy-required": "Please accept the privacy policy.",
    "send-button": "Send Message",
    "valid": "Form was sent successfully!"
  },
  "footer": {
    "legal-notice": "Legal Notice"
  },
  "legal-notice": {
    "headline": "Legal Notice",
    "paragraph": "Information pursuant to Section 5 of the DDG",
    "represented": "Represented by:",
    "resolution": "Consumer dispute resolution / Universal arbitration board",
    "resolution-text": "We do not participate in dispute resolution proceedings before a consumer arbitration board and are not obliged to do so.",
    "build-with-one": "Created with the",
    "build-with-two": "Legal Notice Generator",
    "build-with-three": "by WebsiteWissen.com, the guide for",
    "website": "website creation",
    "homepage": "website creation",
    "and": "and",
    "shopsystem": "shop systems",
    "legal-text": "Legal text by",
    "back": "Back to homepage"
  },
  
  "privacy-policy": {
    "title": "Privacy Policy",
    "section-1-title": "1. Data protection at a glance",
    "general-notes-title": "General information",
    "general-notes-text": "The following notes provide a simple overview of what happens to your personal data when you visit this website. Personal data is any data that can be used to identify you personally. For detailed information on the subject of data protection, please refer to our privacy policy listed below this text.",
    "data-collection-title": "Data collection on this website",
    "who-responsible-title": "Who is responsible for data collection on this website?",
    "who-responsible-text": "Data processing on this website is carried out by the website operator. You can find their contact details in the 'Information on the responsible body' section of this privacy policy.",
    "how-collect-title": "How do we collect your data?",
    "how-collect-text-1": "On the one hand, your data is collected by you providing it to us. This can be, for example, data that you enter in a contact form.",
    "how-collect-text-2": "Other data is collected automatically or after your consent when you visit the website by our IT systems. This is mainly technical data (e.g. internet browser, operating system or time of page view). This data is collected automatically as soon as you enter this website.",
    "what-use-title": "What do we use your data for?",
    "what-use-text": "Part of the data is collected to ensure that the website is provided without errors. Other data can be used to analyze your user behavior. If contracts can be concluded or initiated via the website, the transmitted data will also be processed for contract offers, orders or other order inquiries.",
    "rights-title": "What rights do you have regarding your data?",
    "rights-text-1": "You have the right at any time to receive information about the origin, recipient and purpose of your stored personal data free of charge. You also have a right to request the correction or deletion of this data. If you have given your consent to data processing, you can revoke this consent at any time for the future. You also have the right to request the restriction of the processing of your personal data under certain circumstances. Furthermore, you have a right of appeal to the competent supervisory authority.",
    "rights-text-2": "You can contact us at any time regarding this and other questions on the subject of data protection.",
    "section-2-title": "2. Hosting",
    "hosting-intro": "We host the content of our website with the following provider:",
    "external-hosting-title": "External Hosting",
    "external-hosting-text-1": "This website is hosted externally. The personal data collected on this website is stored on the servers of the host(s). This may include, but is not limited to, IP addresses, contact requests, meta and communication data, contract data, contact details, names, website access and other data generated via a website.",
    "external-hosting-text-2": "External hosting is carried out for the purpose of fulfilling contracts with our potential and existing customers (Art. 6 para. 1 lit. b GDPR) and in the interest of a secure, fast and efficient provision of our online offer by a professional provider (Art. 6 para. 1 lit. f GDPR). If a corresponding consent has been requested, processing takes place exclusively on the basis of Art. 6 para. 1 lit. a GDPR and § 25 para. 1 TDDDG, insofar as the consent includes the storage of cookies or access to information in the user's terminal device (e.g. device fingerprinting) within the meaning of the TDDDG. Consent can be revoked at any time.",
    "external-hosting-text-3": "Our host(s) will only process your data to the extent necessary to fulfill its performance obligations and follow our instructions regarding this data.",
    "hoster-label": "We use the following host(s):",
    "section-3-title": "3. General notes and mandatory information",
    "privacy-title": "Data Protection",
    "privacy-text-1": "The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this privacy policy.",
    "privacy-text-2": "When you use this website, various personal data are collected. Personal data is data with which you can be personally identified. This privacy policy explains what data we collect and what we use it for. It also explains how and for what purpose this happens.",
    "privacy-text-3": "We point out that data transmission on the Internet (e.g. communication by e-mail) can have security gaps. A complete protection of data against access by third parties is not possible.",
    "responsible-title": "Note on the responsible body",
    "responsible-intro": "The responsible body for data processing on this website is:",
    "responsible-definition": "The responsible body is the natural or legal person who alone or jointly with others decides on the purposes and means of processing personal data (e.g. names, e-mail addresses, etc.).",
    "storage-duration-title": "Storage duration",
    "storage-duration-text": "Unless a more specific storage period has been mentioned within this privacy policy, your personal data will remain with us until the purpose for data processing no longer applies. If you assert a legitimate request for deletion or revoke your consent to data processing, your data will be deleted unless we have other legally permissible reasons for storing your personal data (e.g. tax or commercial law retention periods); in the latter case, deletion takes place after these reasons no longer apply.",
    "legal-basis-title": "General information on the legal basis of data processing on this website",
    "legal-basis-text": "If you have consented to data processing, we process your personal data on the basis of Art. 6 para. 1 lit. a GDPR or Art. 9 para. 2 lit. a GDPR if special categories of data according to Art. 9 para. 1 GDPR are processed. In the event of express consent to the transfer of personal data to third countries, data processing also takes place on the basis of Art. 49 para. 1 lit. a GDPR. If you have consented to the storage of cookies or to access to information in your terminal device (e.g. via device fingerprinting), data processing is additionally based on § 25 para. 1 TDDDG. Consent can be revoked at any time. If your data is required for the fulfillment of a contract or for the performance of pre-contractual measures, we process your data on the basis of Art. 6 para. 1 lit. b GDPR. Furthermore, we process your data if it is required to fulfill a legal obligation on the basis of Art. 6 para. 1 lit. c GDPR. Data processing can also take place on the basis of our legitimate interest according to Art. 6 para. 1 lit. f GDPR. Information about the relevant legal basis in each individual case is provided in the following paragraphs of this privacy policy.",
    "recipients-title": "Recipients of personal data",
    "recipients-text": "As part of our business activities, we work with various external bodies. In some cases, it is also necessary to transfer personal data to these external bodies. We only pass on personal data to external bodies if this is necessary as part of the fulfillment of a contract, if we are legally obliged to do so (e.g. passing on data to tax authorities), if we have a legitimate interest in passing it on in accordance with Art. 6 para. 1 lit. f GDPR or if another legal basis allows the data to be passed on. When using processors, we only pass on personal data of our customers on the basis of a valid contract for order processing. In the case of joint processing, a contract for joint processing is concluded.",
    "revocation-title": "Revocation of your consent to data processing",
    "revocation-text": "Many data processing operations are only possible with your express consent. You can revoke consent already given at any time. The legality of the data processing carried out until the revocation remains unaffected by the revocation.",
    "objection-title": "Right to object to data collection in special cases and to direct advertising (Art. 21 GDPR)",
    "objection-text-1": "IF THE DATA PROCESSING IS BASED ON ART. 6 PARA. 1 LIT. E OR F GDPR, YOU HAVE THE RIGHT AT ANY TIME TO OBJECT TO THE PROCESSING OF YOUR PERSONAL DATA FOR REASONS ARISING FROM YOUR PARTICULAR SITUATION; THIS ALSO APPLIES TO PROFILING BASED ON THESE PROVISIONS. THE RESPECTIVE LEGAL BASIS ON WHICH PROCESSING IS BASED CAN BE FOUND IN THIS PRIVACY POLICY. IF YOU OBJECT, WE WILL NO LONGER PROCESS YOUR CONCERNED PERSONAL DATA UNLESS WE CAN PROVE COMPELLING REASONS FOR THE PROCESSING WORTHY OF PROTECTION THAT OUTWEIGH YOUR INTERESTS, RIGHTS AND FREEDOMS OR THE PROCESSING SERVES THE ASSERTION, EXERCISE OR DEFENSE OF LEGAL CLAIMS (OBJECTION ACCORDING TO ART. 21 PARA. 1 GDPR).",
    "objection-text-2": "IF YOUR PERSONAL DATA IS PROCESSED FOR DIRECT ADVERTISING, YOU HAVE THE RIGHT TO OBJECT AT ANY TIME TO THE PROCESSING OF YOUR PERSONAL DATA FOR THE PURPOSE OF SUCH ADVERTISING; THIS ALSO APPLIES TO PROFILING INSOFAR AS IT IS CONNECTED WITH SUCH DIRECT ADVERTISING. IF YOU OBJECT, YOUR PERSONAL DATA WILL SUBSEQUENTLY NO LONGER BE USED FOR THE PURPOSE OF DIRECT ADVERTISING (OBJECTION ACCORDING TO ART. 21 PARA. 2 GDPR).",
    "complaint-title": "Right of appeal to the competent supervisory authority",
    "complaint-text": "In the event of violations of the GDPR, data subjects have a right of appeal to a supervisory authority, in particular in the Member State of their habitual residence, their place of work or the place of the alleged violation. The right of appeal is without prejudice to other administrative or judicial remedies.",
    "portability-title": "Right to data portability",
    "portability-text": "You have the right to have data that we process automatically on the basis of your consent or in fulfillment of a contract handed over to you or to a third party in a standard, machine-readable format. If you request the direct transfer of the data to another controller, this will only be done insofar as it is technically feasible.",
    "info-correction-deletion-title": "Information, correction and deletion",
    "info-correction-deletion-text": "Within the framework of the applicable legal provisions, you have the right at any time to free information about your stored personal data, its origin and recipient and the purpose of the data processing and, if applicable, a right to correction or deletion of this data. You can contact us at any time regarding this and other questions on the subject of personal data.",
    "restriction-title": "Right to restriction of processing",
    "restriction-intro": "You have the right to request the restriction of the processing of your personal data. You can contact us at any time for this purpose. The right to restriction of processing exists in the following cases:",
    "restriction-item-1": "If you dispute the accuracy of your personal data stored with us, we usually need time to check this. For the duration of the audit, you have the right to request the restriction of the processing of your personal data.",
    "restriction-item-2": "If the processing of your personal data happened/happens unlawfully, you can request the restriction of data processing instead of deletion.",
    "restriction-item-3": "If we no longer need your personal data, but you need it to exercise, defend or assert legal claims, you have the right to request restriction of the processing of your personal data instead of deletion.",
    "restriction-item-4": "If you have lodged an objection according to Art. 21 para. 1 GDPR, a balance must be struck between your interests and ours. As long as it is not yet clear whose interests prevail, you have the right to request the restriction of the processing of your personal data.",
    "restriction-footer": "If you have restricted the processing of your personal data, this data – apart from its storage – may only be processed with your consent or for the assertion, exercise or defense of legal claims or for the protection of the rights of another natural or legal person or for reasons of an important public interest of the European Union or a Member State.",
    "section-4-title": "4. Data collection on this website",
    "contact-form-title": "Contact form",
    "contact-form-text-1": "If you send us inquiries via the contact form, your details from the inquiry form, including the contact details you provided there, will be stored by us for the purpose of processing the inquiry and in case of follow-up questions. We do not pass on this data without your consent.",
    "contact-form-text-2": "The processing of this data takes place on the basis of Art. 6 para. 1 lit. b GDPR, insofar as your inquiry is related to the fulfillment of a contract or is necessary for the performance of pre-contractual measures. In all other cases, processing is based on our legitimate interest in the effective processing of inquiries addressed to us (Art. 6 para. 1 lit. f GDPR) or on your consent (Art. 6 para. 1 lit. a GDPR) if this was requested; consent can be revoked at any time.",
    "contact-form-text-3": "The data you enter in the contact form will remain with us until you request deletion, revoke your consent to storage or the purpose for data storage no longer applies (e.g. after your inquiry has been processed). Mandatory statutory provisions – in particular retention periods – remain unaffected.",
    "direct-contact-title": "Inquiry by e-mail, telephone or fax",
    "direct-contact-text-1": "If you contact us by e-mail, telephone or fax, your inquiry including all resulting personal data (name, inquiry) will be stored and processed by us for the purpose of processing your concern. We do not pass on this data without your consent.",
    "direct-contact-text-2": "The processing of this data takes place on the basis of Art. 6 para. 1 lit. b GDPR, insofar as your inquiry is related to the fulfillment of a contract or is necessary for the performance of pre-contractual measures. In all other cases, processing is based on our legitimate interest in the effective processing of inquiries addressed to us (Art. 6 para. 1 lit. f GDPR) or on your consent (Art. 6 para. 1 lit. a GDPR) if this was requested; consent can be revoked at any time.",
    "direct-contact-text-3": "The data sent to us by you via contact requests will remain with us until you request deletion, revoke your consent to storage or the purpose for data storage no longer applies (e.g. after your concern has been processed). Mandatory statutory provisions – in particular statutory retention periods – remain unaffected.",
    "section-5-title": "5. Plugins and Tools",
    "google-fonts-title": "Google Fonts (local hosting)",
    "google-fonts-text-1": "This page uses so-called Google Fonts, which are provided by Google, for the uniform display of fonts. The Google Fonts are installed locally. A connection to Google's servers does not take place.",
    "google-fonts-text-2": "Further information about Google Fonts can be found at",
    "google-fonts-text-3": "and in Google's privacy policy:",
    "source": "Source:",
    "back": "Back to homepage"
  }
}

